import numpy as np

# Data analysis ДЗ №1
# Задача 1 ---------------------------------------------------------------------------------------

print('Задача 1')
temps = np.array([15.2, 16.8, 14.5, 17.0, 16.1])

min_ =  round(temps.min(), 2)
max_ =  round(temps.max(), 2)
avg = round(temps.mean(), 2)
sum_=  round(temps.sum(), 2)
print(f'Характеристики массива temps:\n'
      f'{temps}\n'
      f'- минимальный элемент: {min_}\n'
      f'- максимальный элемент: {max_}\n'
      f'- среднее элементов: {avg}\n'
      f'- сумма всех элементов: {sum_}\n')

# Задача 2 ---------------------------------------------------------------------------------------

print('Задача 2')
h1 = np.array([45, 50, 47])
h2 = np.array([48, 46, 52])

sum_ = h1 + h2
product = h1 * h2
scalar = h1 @ h2
print(f'Для двух векторов:\n'
      f'h1 = {h1}\n'
      f'h2 = {h2}\n'
      f'поэлементная\n'
      f'- сумма: {sum_}\n'
      f'- произведение: {product}\n'
      f'- скалярное произведение: {scalar}\n')

# Задача 3 ---------------------------------------------------------------------------------------

print('Задача 3')
x = np.array([
[20.1, 20.3, 19.8],
[21.0, 20.7, 20.2],
[19.5, 19.8, 19.3],
[20.8, 21.1, 20.6]
])

avg_all = x.mean(axis=0).round(decimals=2)
sum_rows = x.sum(axis=1)
var = x.var(axis=0, ddof=1).round(decimals=2)
min_indices = np.where(var == var.min())[0]
print(f'Для матрицы показания температуры:\n'
      f'{x}\n'
      f'- Среднее по столбцам: {avg_all}\n'
      f'- Сумму по строкам: {sum_rows}\n'
      f'- Дисперсию по столбцам с ddof=1: {var}\n'
      f'- Индекс столбца (сенсора) с минимальной дисперсией: {min_indices}\n')